# Nesta aula iremos aprender sobre a biblioteca pandas e as suas funções

In [2]:
import pandas as pd

In [16]:
df = pd.read_csv('https://raw.githubusercontent.com/carlosfab/curso_data_science_na_pratica/master/modulo_02/BBAS3.SA.csv')
df.head()

         Date       Open       High        Low      Close  Adj Close    Volume
0  2018-09-21  29.730000  30.580000  29.340000  30.580000  28.680056  16301600
1  2018-09-24  30.379999  30.700001  29.500000  29.730000  27.882866  13086900
2  2018-09-25  29.030001  29.760000  28.809999  29.549999  27.714045  11742900
3  2018-09-26  29.650000  29.969999  29.209999  29.450001  27.620264  12842400
4  2018-09-27  29.680000  30.299999  29.680000  30.290001  28.408072   8767900

**VENDO O TIPO DAS COLUNAS**

In [14]:
df.dtypes

Date          object
Open         float64
High         float64
Low          float64
Close        float64
Adj Close    float64
Volume         int64
dtype: object

**VENDO O NOME DE TODAS AS COLUNAS**

In [19]:
df.columns

Index(['Date', 'Open', 'High', 'Low', 'Close', 'Adj Close', 'Volume'], dtype='object')

**VENDO OS DADOS DE UMA COLUNA ESPECIFICA**

In [23]:
df['Open'].head(7)

0    29.730000
1    30.379999
2    29.030001
3    29.650000
4    29.680000
5    29.830000
6    29.549999
Name: Open, dtype: float64

In [24]:
#Fazendo uma média dos dados de Open

df['Open'].mean()

47.51630076829271

# Criando um DataFrame

In [28]:
dados = {
    'nome': ['Carlos','Pedro','Daniela','Fernanda'],
    'idade':[35,32,15,49],
    'cidade': ['Araraquara','Belém','Natal','Curitiba'],
    'comprou':[True, False, False, True]
}

#Visualizando os dados
dados

{'nome': ['Carlos', 'Pedro', 'Daniela', 'Fernanda'],
 'idade': [35, 32, 15, 49],
 'cidade': ['Araraquara', 'Belém', 'Natal', 'Curitiba'],
 'comprou': [True, False, False, True]}

In [29]:
#Criar o Dataframe

df=pd.DataFrame(dados)

#Visualizar o Dataframe

df

       nome  idade      cidade  comprou
0    Carlos     35  Araraquara     True
1     Pedro     32       Belém    False
2   Daniela     15       Natal    False
3  Fernanda     49    Curitiba     True

In [31]:
#Criando uma coluna para o DataFrame

df['Saldo'] = 0.0,100,250,300

df

       nome  idade      cidade  comprou  Saldo
0    Carlos     35  Araraquara     True    0.0
1     Pedro     32       Belém    False  100.0
2   Daniela     15       Natal    False  250.0
3  Fernanda     49    Curitiba     True  300.0

In [34]:
#Alterando o Index

df.index = ['a','b','c','d']
df

       nome  idade      cidade  comprou  Saldo
a    Carlos     35  Araraquara     True    0.0
b     Pedro     32       Belém    False  100.0
c   Daniela     15       Natal    False  250.0
d  Fernanda     49    Curitiba     True  300.0

In [36]:
#Alterando os nomes da colunas

df.columns=['Nome do cliente','Idade','Cidade','Transação','Saldo na Loja']
df

  Nome do cliente  Idade      Cidade  Transação  Saldo na Loja
a          Carlos     35  Araraquara       True            0.0
b           Pedro     32       Belém      False          100.0
c         Daniela     15       Natal      False          250.0
d        Fernanda     49    Curitiba       True          300.0